_posts/2010-10-23-thesaurus-api.html
---
layout: post
title: Online Thesaurus APIs
categories:
- API
- code
- internet
---


<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">The problem? </h3>
<div class="outline-text-3" id="text-1">

<p>I need an online API for finding synonyms in emacs for a project I'm planning on playing around with. Basically allowing me to find synonyms for words within emacs.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">Dictionary.com </h3>
<div class="outline-text-3" id="text-2">

<p><b>Limits:</b> 
</p><ul>
<li>
Only I can use the key, others have to get there own.
</li>
<li>
Up to two days to get a key.

</li>
</ul>

<p>After I found this out, I decided dictionary.com was not a good match for my project.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">Words.bighugelabs.com/api.php </h3>
<div class="outline-text-3" id="text-3">

<p><b>Limits:</b>
</p><ul>
<li>
Only I can use the key, others have to get there own.
</li>
<li>
"Only" 10,000 requests a day for free. Not relevant for my purposes.

</li>
</ul>

<p>10,000 requests a day should be more than sufficient for <b>my</b> purposes and for anyone it is, there is the option to pay more to get more requests. As such, this should be good API.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">Find a list </h3>
<div class="outline-text-3" id="text-4">

<p>Finding a list would be ideal, I've yet to find a good one. I'm going to keep looking for one, but to proceed I'm going to with an API.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5">Conclusion </h3>
<div class="outline-text-3" id="text-5">

<p>My plan is to use an API, I'll cache the results locally. I'll look over the terms of service and build up the default cache that will be distributed with it.
</p>
<p>
<b>Let me know if you know of any good lists of synonyms</b>
</p></div>
</div>
